me.org
#+startup: content indent
* Early Init
** Basic frame settings.

#+begin_src emacs-lisp :tangle "early-init.el"
(setq frame-resize-pixelwise t
      frame-inhibit-implied-resize 'force
      frame-title-format '("%b")
      ring-bell-function 'ignore
      use-dialog-box t ; only for mouse events, which I seldom use
      use-file-dialog nil
      use-short-answers t
      inhibit-splash-screen t
      inhibit-startup-screen t
      inhibit-x-resources t
      inhibit-startup-echo-area-message user-login-name ; read the docstring
      inhibit-startup-buffer-menu t)
#+end_src

** Code to set frame parameters for like menu bar tool bar and scroll bar.

#+begin_src emacs-lisp :tangle "early-init.el"
(dolist (variable '(initial-frame-alist default-frame-alist))
  (set variable `((width . (text-pixels . 800))
                  (height . (text-pixels . 900))
                  (horizontal-scroll-bars . nil)
                  (menu-bar-lines . 0) ; alternative to disabling `menu-bar-mode'
                  (tool-bar-lines . 0) ; alternative to disabling `tool-bar-mode'
                  ,@(if x-toolkit-scroll-bars
                        (list
                         '(vertical-scroll-bars . nil)
                         '(scroll-bar-width . 12))
                      (list
                       '(vertical-scroll-bars . right)
                       '(scroll-bar-width . 6))))))

(defun prot-emacs-no-minibuffer-scroll-bar (frame)
  "Remove the minibuffer scroll bars from FRAME."
  (when scroll-bar-mode
    (set-window-scroll-bars (minibuffer-window frame) nil nil nil nil :persistent)))

(add-hook 'after-make-frame-functions #'prot-emacs-no-minibuffer-scroll-bar)
#+end_src

** Startup time and garbage collection
#+begin_src emacs-lisp :tangle "early-init.el"
;; Temporarily increase the garbage collection threshold.  These
;; changes help shave off about half a second of startup time.  The
;; `most-positive-fixnum' is DANGEROUS AS A PERMANENT VALUE.  See the
;; `emacs-startup-hook' a few lines below for what I actually use.
(setq gc-cons-threshold most-positive-fixnum
      gc-cons-percentage 0.5)

;; Same idea as above for the `file-name-handler-alist' and the
;; `vc-handled-backends' with regard to startup speed optimisation.
;; Here I am storing the default value with the intent of restoring it
;; via the `emacs-startup-hook'.
(defvar prot-emacs--file-name-handler-alist file-name-handler-alist)
(defvar prot-emacs--vc-handled-backends vc-handled-backends)

(setq file-name-handler-alist nil
      vc-handled-backends nil)

(add-hook 'emacs-startup-hook
          (lambda ()
            (setq gc-cons-threshold (* 100 100 8)
                  gc-cons-percentage 0.1
                  file-name-handler-alist prot-emacs--file-name-handler-alist
                  vc-handled-backends prot-emacs--vc-handled-backends)))
#+end_src

* Init
** Straight setup
This setups up straight
#+begin_src emacs-lisp :tangle "init.el"
;; Setup straight package manager
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name
        "straight/repos/straight.el/bootstrap.el"
        (or (bound-and-true-p straight-base-dir)
            user-emacs-directory)))
      (bootstrap-version 7))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
        (url-retrieve-synchronously
         "https://raw.githubusercontent.com/radian-software/straight.el/develop/install.el"
         'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(setq package-enable-at-startup nil)
(straight-use-package 'use-package)
#+end_src

** Evil want keybinding at the beninging

I'm not sure why it won't work with the =:init= macro in the evil =use-package=. 

#+begin_src emacs-lisp :tangle "init.el"
(defvar evil-want-keybinding nil
  "Set to nil because evil-collection is used for keybindings.")
#+end_src

** TODO idk yet

#+begin_src emacs-lisp :tangle "init.el"
(global-visual-line-mode t)
(use-package multiple-cursors
  :straight t)

(use-package spacious-padding
  :straight t
  ;; Use the :custom keyword to set variables defined by the package.
  :custom
  ;; The value is a plist. We only need to specify the keys we want to change.
  (spacious-padding-widths
   '(
     :internal-border-width 40      ; Make the main side margins much larger
     :right-divider-width 1         ; Make window dividers invisible
     :fringe-width 15               ; Add a bit more space for fringe indicators
     :header-line-width 0           ; Remove header line padding
     :mode-line-width 4)))          ; Slightly smaller mode-line padding

(use-package doom-modeline
  :straight t
  :config
  (doom-modeline-mode))
#+end_src

** Modules and custom libraries
#+begin_src emacs-lisp :tangle "init.el"
;; This adds all elisp files from the modules and lisp folder
(mapc
 (lambda (string)
   (add-to-list 'load-path (locate-user-emacs-file string)))
 '("modules" "cloutlu-lisp"))
#+end_src

** Load the individual modules

For everything that is found in [[id:d4dbd0e3-3123-482f-a6ce-6e9db93937b9][Lisp]]

#+begin_src emacs-lisp :tangle "init.el"
;;  This loads the extra lisp I provide for some extra functionality
(require 'cloutlu-narrow)
(require 'cloutlu-org-extra)
(require 'cloutlu-core-helpers)
#+end_src

This loads the individual modules from the =modules= folder.
#+begin_src emacs-lisp :tangle "init.el"
(require 'cloutlu-bind) ;; This must go first as other package rely on general for binding
(require 'cloutlu-vertico)
(require 'cloutlu-which-key)
(require 'cloutlu-essentials)
(require 'cloutlu-dired)
(require 'cloutlu-org)
(require 'cloutlu-zen)
#+end_src

** Tweaks
*** Native Compilation Silent

#+begin_src emacs-lisp :tangle "init.el"
;; Make native compilation silent and prune its cache.
(when (native-comp-available-p)
  (setq native-comp-async-report-warnings-errors 'silent) ; Emacs 28 with native compilation
  (setq native-compile-prune-cache t)) ; Emacs 29
#+end_src
*** Don't create backup or lockfiles

#+begin_src emacs-lisp :tangle "init.el"
;; Don't generate backups or lockfiles. While auto-save maintains a copy so long
;; as a buffer is unsaved, backups create copies once, when the file is first
;; written, and never again until it is killed and reopened. This is better
;; suited to version control, and I don't want world-readable copies of
;; potentially sensitive material floating around our filesystem.

(defvar cloutlu-cache-dir nil
  "My cache directory, if linux it should
  be like XDG home dir/..., windows can just deal with it being messy")
(defvar cloutlu-data-dir nil
  "My data directory, if linux it should be like XDG home dir/..., windows can just deal with it being messy")
(defvar cloutlu-state-dir nil
  "My state directory, if linux it should be like XDG home dir/..., windows can just deal with it being messy")

(setq cloutlu-cache-dir "~/.local/cache"
      cloutlu-data-dir  "~/.local/data"
      cloutlu-state-dir "~/.local/state")

(setq create-lockfiles nil
      make-backup-files nil
      ;; But in case the user does enable it, some sensible defaults:
      version-control t     ; number each backup file
      backup-by-copying t   ; instead of renaming current file (clobbers links)
      delete-old-versions t ; clean up after itself
      kept-old-versions 5
      kept-new-versions 5
      backup-directory-alist (list (cons "." (concat cloutlu-cache-dir "backup/")))
      tramp-backup-directory-alist backup-directory-alist)
#+end_src

** Send custom-file to oblivion
#+begin_src emacs-lisp :tangle "init.el"
;; Disable the damn thing by making it disposable.
(setq custom-file (make-temp-file "emacs-custom-"))
#+end_src

*** Start with scratch buffer

#+begin_src emacs-lisp :tangle "init.el"
(setq initial-buffer-choice t)
(setq initial-major-mode 'lisp-interaction-mode)
(setq initial-scratch-message
      (format ";; This is `%s'.  Use `%s' to evaluate and print results.\n\n"
              'lisp-interaction-mode
              (propertize
               (substitute-command-keys "\\<lisp-interaction-mode-map>\\[eval-print-last-sexp]")
               'face 'help-key-binding)))
#+end_src

** tempel

A basic templating system, this shouldn't replace yasnippet but I have
no need to even use that thing in the first place, this is more than enough.

#+begin_src emacs-lisp :tangle "init.el"
(use-package tempel
  :straight t
  :custom
  (tempel-path (concat user-emacs-directory "tempels"))
  :init
  ;; Setup completion at point
  (defun tempel-setup-capf ()
    ;; Add the Tempel Capf to `completion-at-point-functions'.
    ;; `tempel-expand' only triggers on exact matches. Alternatively use
    ;; `tempel-complete' if you want to see all matches, but then you
    ;; should also configure `tempel-trigger-prefix', such that Tempel
    ;; does not trigger too often when you don't expect it. NOTE: We add
    ;; `tempel-expand' *before* the main programming mode Capf, such
    ;; that it will be tried first.
    (setq-local completion-at-point-functions
                (cons #'tempel-expand
                      completion-at-point-functions)))
  :general
  ("M-*" #'tempel-insert)
  (:states '(normal insert emacs)
	   "M-+" #'tempel-complete))
#+end_src

*** Tempels
**** org-mode
#+begin_src lisp-data :tangle "tempels"
org-mode

(caption "#+caption: ")
(drawer ":" p ":" n r ":end:")
(begin "#+begin_" (s name) n> r> n "#+end_" name)
(quote "#+begin_quote" n> r> n "#+end_quote")
(sidenote "#+begin_sidenote" n> r> n "#+end_sidenote")
(marginnote "#+begin_marginnote" n> r> n "#+end_marginnote")
(example "#+begin_example" n> r> n "#+end_example")
(center "#+begin_center" n> r> n "#+end_center")
(ascii "#+begin_export ascii" n> r> n "#+end_export")
(html "#+begin_export html" n> r> n "#+end_export")
(latex "#+begin_export latex" n> r> n "#+end_export")
(comment "#+begin_comment" n> r> n "#+end_comment")
(verse "#+begin_verse" n> r> n "#+end_verse")
(src "#+begin_src " q n r n "#+end_src")
(<s "#+begin_src " r n "#+end_src")
(gnuplot "#+begin_src gnuplot :var data=" (p "table") " :file " (p "plot.png") n r n "#+end_src" :post (org-edit-src-code))
(elisp "#+begin_src emacs-lisp" n r n "#+end_src" :post (org-edit-src-code))
(dafny "src_dafny{" r "}")
(inlsrc "src_" p "{" q "}")
(title "#+title: " p n "#+author: Morgan Perry" n "#+language: en")
(quilt "#+HTML_HEAD_EXTRA: <style> .quiltish img { max-height: 200px; min-height: 100px; } </style>"
       n "#+attr_html: :class quiltish"
       n "#+caption: " p
       n "#+begin_figure"
       n r
       n "#+end_figure")
#+end_src

**** Set tempels file metadata

#+begin_src lisp-data :tangle "tempels"
;; Local Variables:
;; mode: lisp-data
;; outline-regexp: "[a-z]"
;; End:
#+end_src
** Corfu

This is the completion popup along with capf functionality provided from cape.

#+begin_src emacs-lisp :tangle "init.el"
(use-package corfu
  :straight t
  ;; Optional customizations
  :config
  (setq corfu-auto t
        corfu-auto-delay 0.24
        corfu-auto-prefix 2
        global-corfu-modes
        '((not erc-mode
               circe-mode
               help-mode
               gud-mode
               vterm-mode)
          t)
        corfu-cycle t
        corfu-preselect 'prompt
        corfu-count 16
        corfu-max-width 120
        corfu-on-exact-match nil
        ;; corfu-quit-at-boundary (if (or (modulep! :completion vertico)
        ;;                                (modulep! +orderless))
        ;;                            'separator t)
        corfu-quit-no-match corfu-quit-at-boundary
        tab-always-indent 'complete

	text-mode-ispell-word-completion nil

	read-extended-command-predicate #'command-completion-default-include-p)
  :init
  (global-corfu-mode)
  ;; Enable optional extension modes:
  (corfu-history-mode)
  (corfu-popupinfo-mode))

(use-package cape
  :straight t
  :init
  (add-hook! 'completion-at-point-functions #'cape-dabbrev)
  (add-hook! 'completion-at-point-functions #'cape-file)
  (add-hook! 'completion-at-point-functions #'cape-elisp-block))
#+end_src

** Magit

The best git client :)

#+begin_src emacs-lisp :tangle "init.el"
(use-package magit
  :straight t) 
#+end_src

** Git auto commit mode

#+begin_src emacs-lisp :tangle "init.el"
(use-package git-auto-commit-mode
  :straight t)
#+end_src

* Modules
** Bindings
This module sets up the global keybinding system using `general.el` and 'evil'
It establishes `SPC` as the leader key and ensures its bindings have
the highest priority.
*** General.el
:PROPERTIES:
:ID:       0eb8cf18-5f97-4ee5-a403-dd5e4b0a1e53
:END:

**** Use-package

#+begin_src emacs-lisp :tangle "modules/cloutlu-bind.el" :mkdirp yes
(use-package general
  :straight t
  :after (evil evil-collection which-key)
  :demand t)
#+end_src

**** Bindings

***** Non-Leader bindings

#+begin_src emacs-lisp :tangle "modules/cloutlu-bind.el" :mkdirp yes
;; Non-leader bindings
(general-def '(normal visual)
  "C-u" #'evil-scroll-up
  "C-s" #'consult-line
  "C-M-s" #'consult-line-multi)
#+end_src

