modules/cloutlu-bind.el
(use-package general
  :straight t
  :after (evil evil-collection which-key)
  :demand t)
