me.org
***** Leader Bindings

#+begin_src emacs-lisp :tangle "modules/cloutlu-bind.el" :mkdirp yes

(general-define-key
 :states '(normal motion)
 :keymaps 'override
 :prefix "SPC"
 :prefix-map 'cloutlu-leader-map)

;; Main leader definer
(general-create-definer cloutlu-leader-def
  :keymaps 'cloutlu-leader-map)
#+end_src

***** General

#+begin_src emacs-lisp :tangle "modules/cloutlu-bind.el" :mkdirp yes
;; Define the general keybindings
(cloutlu-leader-def
  "SPC"   '("M-x" . execute-extended-command)
  ;; Misc
  "h t"   'consult-theme
  "t z"   'cloutlu/toggle-zen-mode
  "g g"   'magit
  "h m"   'consult-man
  "h i"   'consult-info
  ;; Files
  "f"     (cons "files" (make-sparse-keymap))
  "f f"   'find-file
  "f d"   'dired
  "/"     'consult-ripgrep
  "f F"   'consult-fd
  "o -"   'dired-jump
  ;; Help
  "h"       (cons "help" (make-sparse-keymap))
  "h v"     'describe-variable
  "h f"     'describe-function
  "h k"     'describe-key
  "h P"     'describe-package
  "h m"     'describe-mode
  "h K"     'describe-keymap
  "h x"     'describe-command
  ;; Windows
  "w"       (cons "windows" (make-sparse-keymap))
  "w TAB"   'alternate-window
  "w b"     'switch-to-minibuffer-window
  "w d"     'delete-window
  "w o"     'delete-other-windows
  "w h"     'evil-window-left
  "w j"     'evil-window-down
  "w k"     'evil-window-up
  "w l"     'evil-window-right
  "w v"     'split-window-horizontally
  "w s"     'split-window-vertically
  ;; Buffers/Bookmarks
  "b"   (cons "buffers/bookmarks" (make-sparse-keymap))
  "`"   'previous-buffer 
  "b b" 'consult-buffer
  "p b" 'consult-project-buffer
  "RET" 'consult-bookmark
  "b r" 'revert-buffer
  ;; Search
  "s"   (cons "search" (make-sparse-keymap))
  "s s" 'consult-line
  "s i" 'consult-outline
  "s g" 'consult-git-grep
  "s k" 'consult-focus-lines
  )
#+end_src

*** Evil and evil-collection 

#+begin_src emacs-lisp :tangle "modules/cloutlu-bind.el" :mkdirp yes
(use-package evil
  :straight t
  :demand t
  :init
  (setq evil-want-integration t) ;; This is optional since it's already set to t by default.
  (setq evil-respect-visual-line-mode t)
  (setq evil-move-line-on-visual-line t)
  :config
  (evil-mode 1))

(use-package evil-collection
  :straight t
  :after evil
  :config
  (evil-collection-init))
#+end_src

*** Provide the module
#+begin_src emacs-lisp :tangle "modules/cloutlu-bind.el" :mkdirp yes
(provide 'cloutlu-bind)
#+end_src

** Essentials
*** Load theme and fonts

I don't currently have a good way to load/manage themes...
Most of this is using prot's  packages.

#+begin_src emacs-lisp :tangle "modules/cloutlu-essentials.el" :mkdirp yes
;;; Essential configuration
(use-package doric-themes
  :straight t
  :config
  (setq doric-themes-mixed-fonts t)
  (add-hook 'text-mode-hook #'variable-pitch-mode))

(use-package ef-themes
  :straight t
  :config
  (setq ef-themes-mixed-fonts t)
  (add-hook 'text-mode-hook #'variable-pitch-mode))

(load-theme 'doric-obsidian t)

(use-package fontaine
  :straight t
  :general
  ("C-c f" #'fontaine-set-preset)
  :config
  (setq fontaine-latest-state-file
	(locate-user-emacs-file "fontaine-latest-state.eld"))

  (setq fontaine-presets
	'((small
           :default-family "Aporetic Serif Mono"
           :default-height 80
           :variable-pitch-family "Aporetic Sans")
          (regular) ; like this it uses all the fallback values and is named `regular'
          (medium
           :default-weight semilight
           :default-height 115
           :bold-weight extrabold)
          (large
           :inherit medium
           :default-height 150)
          (presentation
           :default-height 180)
          (t
           ;; I keep all properties for didactic purposes, but most can be
           ;; omitted.  See the fontaine manual for the technicalities:
           ;; <https://protesilaos.com/emacs/fontaine>.
           :default-family "Aporetic Sans Mono"
           :default-weight regular
           :default-height 100

           :fixed-pitch-family nil ; falls back to :default-family
           :fixed-pitch-weight nil ; falls back to :default-weight
           :fixed-pitch-height 1.0

           :fixed-pitch-serif-family nil ; falls back to :default-family
           :fixed-pitch-serif-weight nil ; falls back to :default-weight
           :fixed-pitch-serif-height 1.0

           :variable-pitch-family "Aporetic Serif"
           :variable-pitch-weight nil
           :variable-pitch-height 1.0

           :mode-line-active-family nil ; falls back to :default-family
           :mode-line-active-weight nil ; falls back to :default-weight
           :mode-line-active-height 0.9

           :mode-line-inactive-family nil ; falls back to :default-family
           :mode-line-inactive-weight nil ; falls back to :default-weight
           :mode-line-inactive-height 0.9

           :header-line-family nil ; falls back to :default-family
           :header-line-weight nil ; falls back to :default-weight
           :header-line-height 0.9

           :line-number-family nil ; falls back to :default-family
           :line-number-weight nil ; falls back to :default-weight
           :line-number-height 0.9

           :tab-bar-family nil ; falls back to :default-family
           :tab-bar-weight nil ; falls back to :default-weight
           :tab-bar-height 1.0

           :tab-line-family nil ; falls back to :default-family
           :tab-line-weight nil ; falls back to :default-weight
           :tab-line-height 1.0

           :bold-family nil ; use whatever the underlying face has
           :bold-weight bold

           :italic-family nil
           :italic-slant italic

           :line-spacing nil)))

  ;; Set the last preset or fall back to desired style from `fontaine-presets'
  ;; (the `regular' in this case).
  (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))

  ;; Persist the latest font preset when closing/starting Emacs and
  ;; while switching between themes.
   (setq fontaine-latest-state-file
	 (locate-user-emacs-file "fontaine-latest-state.eld"))

   ;; Aporetic is my highly customised build of Iosevka:
   ;; <https://github.com/protesilaos/aporetic>.
   (setq fontaine-presets
	 '((small
            :default-family "Aporetic Serif Mono"
            :default-height 80
            :variable-pitch-family "Aporetic Sans")
           (regular) ; like this it uses all the fallback values and is named `regular'
           (medium
            :default-weight semilight
            :default-height 115
            :bold-weight extrabold)
           (large
            :inherit medium
            :default-height 150)
           (presentation
            :default-height 180)
           (t
            ;; I keep all properties for didactic purposes, but most can be
            ;; omitted.  See the fontaine manual for the technicalities:
            ;; <https://protesilaos.com/emacs/fontaine>.
            :default-family "Aporetic Sans Mono"
            :default-weight regular
            :default-height 100

            :fixed-pitch-family nil ; falls back to :default-family
            :fixed-pitch-weight nil ; falls back to :default-weight
            :fixed-pitch-height 1.0

            :fixed-pitch-serif-family nil ; falls back to :default-family
            :fixed-pitch-serif-weight nil ; falls back to :default-weight
            :fixed-pitch-serif-height 1.0

            :variable-pitch-family "Aporetic Serif"
            :variable-pitch-weight nil
            :variable-pitch-height 1.0

            :mode-line-active-family nil ; falls back to :default-family
            :mode-line-active-weight nil ; falls back to :default-weight
            :mode-line-active-height 0.9

            :mode-line-inactive-family nil ; falls back to :default-family
            :mode-line-inactive-weight nil ; falls back to :default-weight
            :mode-line-inactive-height 0.9

            :header-line-family nil ; falls back to :default-family
            :header-line-weight nil ; falls back to :default-weight
            :header-line-height 0.9

            :line-number-family nil ; falls back to :default-family
            :line-number-weight nil ; falls back to :default-weight
            :line-number-height 0.9

            :tab-bar-family nil ; falls back to :default-family
            :tab-bar-weight nil ; falls back to :default-weight
            :tab-bar-height 1.0

            :tab-line-family nil ; falls back to :default-family
            :tab-line-weight nil ; falls back to :default-weight
            :tab-line-height 1.0

            :bold-family nil ; use whatever the underlying face has
            :bold-weight bold

            :italic-family nil
            :italic-slant italic

            :line-spacing nil)))

   ;; Set the last preset or fall back to desired style from `fontaine-presets'
   ;; (the `regular' in this case).
   (fontaine-set-preset (or (fontaine-restore-latest-preset) 'regular))

   ;; Persist the latest font preset when closing/starting Emacs and
   ;; while switching between themes.
   (fontaine-mode 1)
  )
#+end_src

*** Provide Module

#+begin_src emacs-lisp :tangle "modules/cloutlu-essentials.el" :mkdirp yes
(provide 'cloutlu-essentials)
#+end_src
** Dired
*** Settings for common operations

I mean yeah dude I want to delete just the folder not anything inside it that makes sense!
#+begin_src emacs-lisp :tangle "modules/cloutlu-dired.el" :mkdirp yes
  ;;; Dired file manager and prot-dired.el extras (not actually lol)
(use-package dired
  :ensure nil
  :commands (dired)
  :config
  (setq dired-recursive-copies 'always)
  (setq dired-recursive-deletes 'always)
  (setq delete-by-moving-to-trash t))
#+end_src

*** Provide the module
#+begin_src emacs-lisp :tangle "modules/cloutlu-dired.el" :mkdirp yes
(provide 'cloutlu-dired)
#+end_src

** Org
*** Basic org settings & bindings

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(use-package org
  :ensure nil
  :init
  (setq org-directory (expand-file-name "~/doc/share/org")
	org-archive-location (concat org-directory "/archive.org::")
	org-imenu-depth 7
	org-src-preserve-indentation t)
  ;; Use :general to define high-precedence, buffer-local keys for Org mode.
  ;; These keys do NOT use the SPC leader.
  :general

  ;; General <SPC s> heading
  (:keymaps 'org-mode-map
	    :states 'normal
	    :prefix "SPC"
	    "o a" (cons "org archiving/attachments" (make-sparse-keymap))
	    "o a A" #'org-archive-subtree-default
	    "o a a" #'org-attach
	    "o a d" #'org-attach-delete-one
	    "o a D" #'org-attach-delete-all
	    "o a n" #'org-attach-new
	    "o a o" #'org-attach-open
	    "o a O" #'org-attach-open-in-emacs
	    "o a r" #'org-attach-reveal
	    "o a R" #'org-attach-reveal-in-emacs
	    "o a u" #'org-attach-url
	    )

  ;; A standard Org binding
  (:states 'normal
	   :keymaps 'org-mode-map
	   [remap evil-open-folds]    #'cloutlu/org-hide-next-fold-level
	   [remap evil-close-folds]    #'cloutlu/org-show-next-fold-level
	   "z n" #'cloutlu/smart-narrow
	   "z N" #'cloutlu/widen-indirectly-narrowed-buffer
	   "z i" #'org-toggle-inline-images)
  (:states '(insert normal)
	   :keymaps 'org-mode-map
	   "C-<tab>" 'org-cycle-list-bullet)
)


(use-package evil-org
  :straight t
  :after (org evil)
  :hook (org-mode . evil-org-mode))
#+end_src

*** Org modern

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(straight-use-package '(org :type built-in))
(use-package org-modern
  :straight t
  :config
  (global-org-modern-mode))
#+end_src

*** Org Tidy

This hides the properties drawer and some other metadata in org files that I don't interactic

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(use-package org-tidy
  :straight t
  :general
  (:keymaps 'org-mode-map
	    :states 'normal
	    :prefix "SPC"
	    "t t" #'org-tidy-toggle)
  :hook
  (org-mode . org-tidy-mode))
#+end_src

