me.org
*** Org Roam

My general note taking system. Regular org roam is just as nice but I like to pretend to be an academic.

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(use-package org-roam
  :straight t
  :after org
  :general
  (:keymaps 'org-mode-map
	    :states 'normal
	    :prefix "SPC"
	    "n r"   (cons "org-roam" (make-sparse-keymap))
	    "n r f" #'org-roam-node-find
	    "n r i" #'org-roam-node-insert
	    "n r n" #'org-roam-capture
	    "n r r" #'org-roam-buffer-toggle
	    "n r R" #'org-roam-buffer-display-dedicated
	    "n r s" #'org-roam-db-sync)
  :custom
  (org-roam-directory (concat org-directory "/roam"))
  :config
  (setq org-roam-node-display-template (concat "${title:*} " (propertize "${tags:10}" 'face 'org-tag)))
  (org-roam-db-autosync-mode)
  )
#+end_src

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(use-package nerd-icons
  :straight t
  ;; :custom
  ;; The Nerd Font you want to use in GUI
  ;; "Symbols Nerd Font Mono" is the default and is recommended
  ;; but you can use any other Nerd Font if you want
  ;; (nerd-icons-font-family "Symbols Nerd Font Mono")
  )

(use-package citar
  :straight t
  :general
  (:states 'normal
	   :prefix "SPC"
	   "n b" #'citar-open-notes)
  
  :init
  (setq org-cite-insert-processor 'citar
        org-cite-follow-processor 'citar
        org-cite-activate-processor 'citar)
  :config
  (setq citar-bibliography '("~/doc/share/org/ref.bib"))
  (setq citar-library-paths '("~/doc/share/org/references/"))
  (setq citar-notes-paths '("~/doc/share/org/roam"))
  (defvar citar-indicator-files-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
              "nf-fa-file_o"
              :face 'nerd-icons-green
              :v-adjust -0.1)
     :function #'citar-has-files
     :padding "  " ; need this because the default padding is too low for these icons
     :tag "has:files"))
  (defvar citar-indicator-links-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
              "nf-fa-link"
              :face 'nerd-icons-orange
              :v-adjust 0.01)
     :function #'citar-has-links
     :padding "  "
     :tag "has:links"))
  (defvar citar-indicator-notes-icons
    (citar-indicator-create
     :symbol (nerd-icons-codicon
              "nf-cod-note"
              :face 'nerd-icons-blue
              :v-adjust -0.3)
     :function #'citar-has-notes
     :padding "    "
     :tag "has:notes"))
  (defvar citar-indicator-cited-icons
    (citar-indicator-create
     :symbol (nerd-icons-faicon
              "nf-fa-circle_o"
              :face 'nerd-icon-green)
     :function #'citar-is-cited
     :padding "  "
     :tag "is:cited"))
  (setq citar-indicators
        (list citar-indicator-files-icons
              citar-indicator-links-icons
              citar-indicator-notes-icons
              citar-indicator-cited-icons)))

(use-package citar-org-roam
  :straight t
  :init
  (after! (citar org-roam)
    (citar-org-roam-mode)))

(after! oc
  (setq org-cite-global-bibliography
        (ensure-list
         (or (bound-and-true-p citar-bibliography)
             (bound-and-true-p bibtex-completion-bibliography)))
        ;; Setup export processor; default csl/citeproc-el, with biblatex for
        ;; latex
        org-cite-export-processors '((latex biblatex) (t csl))
        org-support-shift-select t)

  (require 'oc-biblatex))

;; oc-csl requires citeproc, which requires the top-level org, so loading oc-csl
;; after oc interferes with incremental loading of Org
(after! org (require 'oc-csl))
#+end_src

*** Org attachments
#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
;; Autoload all these commands that org-attach doesn't autoload itself
(use-package org-attach
  :commands (org-attach-delete-one
	     org-attach-delete-all
	     org-attach-new
	     org-attach-open
	     org-attach-open-in-emacs
	     org-attach-reveal-in-emacs
	     org-attach-url
	     org-attach-set-directory
	     org-attach-sync)
  :config
  ;; Centralized attachments directory by default
  (setq org-attach-id-dir (expand-file-name ".attach/" org-directory))

  (setq org-attach-store-link-p 'attached     ; store link after attaching files
	org-attach-use-inheritance t) ; inherit properties from parent nodes
  (after! projectile
    (add-to-list 'projectile-globally-ignored-directories org-attach-id-dir)))

;; Add inline image previews for attachment links
(org-link-set-parameters "attachment" :image-data-fun #'+org-image-file-data-fn)
#+end_src

*** Org Download                                                   :ATTACH:
:PROPERTIES:
:ID:       3ace3042-51dc-4b92-8e8e-4d0b5133b85a
:END:

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(use-package org-download
  :straight t
  :config
  (setq org-download-image-dir 'org-attach-dir
	org-download-method 'attach
	org-download-screenshot-method
	(cond ((executable-find "maim")  "maim -s %s")
              ((executable-find "scrot") "scrot -s %s")
              ((executable-find "gnome-screenshot") "gnome-screenshot -a -f %s"))
	org-download-heading-lvl nil
	org-download-link-format "[[download:%s]]\n"
	org-download-annotate-function (lambda (_link) "")
	org-download-link-format-function
	(lambda (filename)
          (if (eq org-download-method 'attach)
              (format "[[attachment:%s]]\n"
                      (org-link-escape
                       (file-relative-name filename (org-attach-dir))))
            ;; Handle non-image files a little differently. Images should be
            ;; inserted as normal with previews. Other files, like pdfs or zips,
            ;; should be linked to, with an icon indicating the type of file.
            (format (concat (unless (image-type-from-file-name filename)
                              (concat (+org-attach-icon-for filename)
                                      " "))
                            org-download-link-format)
                    (org-link-escape
                     (funcall org-download-abbreviate-filename-function filename)))))
        org-download-abbreviate-filename-function
	(lambda (path)
          (if (file-in-directory-p path org-download-image-dir)
              (file-relative-name path org-download-image-dir)
            path))))
#+end_src

*** Provide the module

#+begin_src emacs-lisp :tangle "modules/cloutlu-org.el" :mkdirp yes
(provide 'cloutlu-org)
#+end_src
** Vertico Setup

These modules are generally for a (personally) more preferable
compleition à la =ido-mode=. Most general functions found in
[[id:0eb8cf18-5f97-4ee5-a403-dd5e4b0a1e53][general.el]] rely on consult, however most of those have similar emacs
functions. Go to the respecting github page to find out the purpose
for each.

*** Vertico

#+begin_src emacs-lisp :tangle "modules/cloutlu-vertico.el"
(use-package vertico
  :straight t
  :init
  (vertico-mode))
#+end_src

*** Marginalia

#+begin_src emacs-lisp :tangle "modules/cloutlu-vertico.el" :mkdirp yes
;; Enable rich annotations using the Marginalia package
(use-package marginalia
  :straight t
  ;; Bind `marginalia-cycle' locally in the minibuffer.  To make the binding
  ;; available in the *Completions* buffer, add it to the
  ;; `completion-list-mode-map'.
  :bind (:map minibuffer-local-map
         ("M-A" . marginalia-cycle))
  :init
  (marginalia-mode))
#+end_src

*** Orderless

#+begin_src emacs-lisp :tangle "modules/cloutlu-vertico.el" :mkdirp yes
;; Optionally use the `orderless' completion style.
(use-package orderless
  :straight t
  :custom
  ;; Configure a custom style dispatcher (see the Consult wiki)
  ;; (orderless-style-dispatchers '(+orderless-consult-dispatch orderless-affix-dispatch))
  ;; (orderless-component-separator #'orderless-escapable-split-on-space)
  (completion-styles '(orderless basic))
  (completion-category-defaults nil)
  (completion-category-overrides '((file (styles partial-completion)))))
#+end_src

