me.org
*** Consult

#+begin_src emacs-lisp :tangle "modules/cloutlu-vertico.el" :mkdirp yes
;; Example configuration for Consult
(use-package consult
  :demand t
  :after vertico
  :straight t
  ;; Replace bindings. Lazily loaded by `use-package'.
  :bind (;; C-c bindings in `mode-specific-map'
         ("C-c M-x" . consult-mode-command)
         ("C-c h" . consult-history)
         ("C-c k" . consult-kmacro)
         ("C-c m" . consult-man)
         ("C-c i" . consult-info)
         ([remap Info-search] . consult-info)
         ;; C-x bindings in `ctl-x-map'
         ("C-x M-:" . consult-complex-command)     ;; orig. repeat-complex-command
         ("C-x b" . consult-buffer)                ;; orig. switch-to-buffer
         ("C-x 4 b" . consult-buffer-other-window) ;; orig. switch-to-buffer-other-window
         ("C-x 5 b" . consult-buffer-other-frame)  ;; orig. switch-to-buffer-other-frame
         ("C-x t b" . consult-buffer-other-tab)    ;; orig. switch-to-buffer-other-tab
         ("C-x r b" . consult-bookmark)            ;; orig. bookmark-jump
         ("C-x p b" . consult-project-buffer)      ;; orig. project-switch-to-buffer
         ;; Custom M-# bindings for fast register access
         ("M-#" . consult-register-load)
         ("M-'" . consult-register-store)          ;; orig. abbrev-prefix-mark (unrelated)
         ("C-M-#" . consult-register)
         ;; Other custom bindings
         ("M-y" . consult-yank-pop)                ;; orig. yank-pop
         ;; M-g bindings in `goto-map'
         ("M-g e" . consult-compile-error)
         ("M-g f" . consult-flymake)               ;; Alternative: consult-flycheck
         ("M-g g" . consult-goto-line)             ;; orig. goto-line
         ("M-g M-g" . consult-goto-line)           ;; orig. goto-line
         ("M-g o" . consult-outline)               ;; Alternative: consult-org-heading
         ("M-g m" . consult-mark)
         ("M-g k" . consult-global-mark)
         ("M-g i" . consult-imenu)
         ("M-g I" . consult-imenu-multi)
         ;; M-s bindings in `search-map'
         ("M-s d" . consult-find)                  ;; Alternative: consult-fd
         ("M-s c" . consult-locate)
         ("M-s g" . consult-grep)
         ("M-s G" . consult-git-grep)
         ("M-s r" . consult-ripgrep)
         ("M-s l" . consult-line )
         ("M-s L" . consult-line-multi)
         ("M-s k" . consult-keep-lines)
         ("M-s u" . consult-focus-lines)
         ;; Isearch integration
         ("M-s e" . consult-isearch-history)
         :map isearch-mode-map
         ("M-e" . consult-isearch-history)         ;; orig. isearch-edit-string
         ("M-s e" . consult-isearch-history)       ;; orig. isearch-edit-string
         ("M-s l" . consult-line)                  ;; needed by consult-line to detect isearch
         ("M-s L" . consult-line-multi)            ;; needed by consult-line to detect isearch
         ;; Minibuffer history
         :map minibuffer-local-map
         ("M-s" . consult-history)                 ;; orig. next-matching-history-element
         ("M-r" . consult-history))                ;; orig. previous-matching-history-element

  ;; Enable automatic preview at point in the *Completions* buffer. This is
  ;; relevant when you use the default completion UI.
  :hook (completion-list-mode . consult-preview-at-point-mode)

  ;; The :init configuration is always executed (Not lazy)
  :init

  ;; Tweak the register preview for `consult-register-load',
  ;; `consult-register-store' and the built-in commands.  This improves the
  ;; register formatting, adds thin separator lines, register sorting and hides
  ;; the window mode line.
  (advice-add #'register-preview :override #'consult-register-window)
  (setq register-preview-delay 0.5)

  ;; Use Consult to select xref locations with preview
  (setq xref-show-xrefs-function #'consult-xref
        xref-show-definitions-function #'consult-xref)

  ;; Configure other variables and modes in the :config section,
  ;; after lazily loading the package.
  :config

  ;; Optionally configure preview. The default value
  ;; is 'any, such that any key triggers the preview.
  ;; (setq consult-preview-key 'any)
  ;; (setq consult-preview-key "M-.")
  ;; (setq consult-preview-key '("S-<down>" "S-<up>"))
  ;; For some commands and buffer sources it is useful to configure the
  ;; :preview-key on a per-command basis using the `consult-customize' macro.
  (consult-customize
   consult-theme :preview-key '(:debounce 0.2 any)
   consult-ripgrep consult-git-grep consult-grep consult-man
   consult-bookmark consult-recent-file consult-xref
   consult--source-bookmark consult--source-file-register
   consult--source-recent-file consult--source-project-recent-file
   ;; :preview-key "M-."
   :preview-key '(:debounce 0.4 any))

  ;; Optionally configure the narrowing key.
  ;; Both < and C-+ work reasonably well.
  (setq consult-narrow-key "<") ;; "C-+"

  ;; Optionally make narrowing help available in the minibuffer.
  ;; You may want to use `embark-prefix-help-command' or which-key instead.
  ;; (keymap-set consult-narrow-map (concat consult-narrow-key " ?") #'consult-narrow-help)
  )
#+end_src

*** Provide the Module

#+begin_src emacs-lisp :tangle "modules/cloutlu-vertico.el" :mkdirp yes
(provide 'cloutlu-vertico)
#+end_src

** Which Key

#+begin_src emacs-lisp :tangle "modules/cloutlu-which-key.el" :mkdirp yes
(use-package which-key
  :ensure nil ; built into Emacs 30
  :hook (after-init . which-key-mode)
  :config
  (setq which-key-separator "  ")
  (setq which-key-prefix-prefix "... ")
  (setq which-key-max-display-columns 3)
  (setq which-key-idle-delay 1.5)
  (setq which-key-idle-secondary-delay 0.25)
  (setq which-key-add-column-padding 1)
  (setq which-key-max-description-length 40))
#+end_src

*** Provide the modules

#+begin_src emacs-lisp :tangle "modules/cloutlu-which-key.el" :mkdirp yes
(provide 'cloutlu-which-key)
#+end_src


** Zen Mode
This module provides a distraction-free "zen" or "focus" mode. It uses
`spacious-padding` to increase margins, `fontaine` to switch to a
larger font preset, and it replaces the complex modeline with a simple,
minimalist one for a comfortable, centered writing environment.

#+begin_src emacs-lisp :tangle "cloutlu-lisp/cloutlu-zen.el" :mkdirp yes
;;; cloutlu-zen.el --- Distraction-free writing environment -*- lexical-binding: t; -*-

;;;; Package Dependencies
;; We declare the packages this module depends on directly within it.

(use-package spacious-padding
  :straight t
  :custom
  ;; These settings are chosen to mimic the default appearance of writeroom-mode.
  (spacious-padding-widths
   '(:internal-border-width 30  ; Creates wide side margins, like writeroom's border
     :right-divider-width 1     ; Makes vertical window dividers nearly invisible
     :fringe-width 10           ; A reasonable default for fringe indicators
     :header-line-width 0       ; No extra padding on the header line
     :mode-line-width 4         ; A tight, clean mode-line padding
     :scroll-bar-width 0)))     ; Ensure no space is allocated for scroll bars

(use-package fontaine :straight t)

;;;; Variables

(defvar cloutlu-zen-mode-active-p nil
  "A boolean to track if Zen mode is currently active.")

(defvar cloutlu-zen--original-font-preset nil
  "Internal variable to store the font preset before activating Zen mode.")

(defvar cloutlu-zen--original-mode-line-format nil
  "Internal variable to store the modeline format before activating Zen mode.")

(defvar cloutlu-zen-font-preset 'large
  "The font preset to use when activating Zen mode.
You can change this to 'presentation or any other preset you have defined.")

(defvar cloutlu-zen-mode-line-format
  '(:eval (propertize " %b %* " 'face 'mode-line))
  "The minimalist modeline format to use in Zen mode.
Set to nil to hide the modeline completely.")

;;;; User-Facing Command

(defun cloutlu/toggle-zen-mode ()
  "Toggle a distraction-free 'zen' mode."
  (interactive)
  (if cloutlu-zen-mode-active-p
      ;; --- DEACTIVATE ZEN MODE ---
      (progn
        (spacious-padding-mode -1)
        ;; Restore the original font preset
        (when cloutlu-zen--original-font-preset
          (fontaine-set-preset cloutlu-zen--original-font-preset))
        ;; Restore the original modeline format
        (when cloutlu-zen--original-mode-line-format
          (setq-local mode-line-format cloutlu-zen--original-mode-line-format))
        (setq cloutlu-zen-mode-active-p nil)
        (message "Zen mode disabled"))
    ;; --- ACTIVATE ZEN MODE ---
    (progn
      ;; Store the current state before changing it
      (setq cloutlu-zen--original-font-preset fontaine-current-preset)
      (setq cloutlu-zen--original-mode-line-format mode-line-format)
      ;; Activate the Zen mode features
      (spacious-padding-mode 1)
      (fontaine-set-preset cloutlu-zen-font-preset)
      (setq-local mode-line-format cloutlu-zen-mode-line-format)
      (setq cloutlu-zen-mode-active-p t)
      (message "Zen mode enabled: using '%s' font preset" cloutlu-zen-font-preset))))

;;;; Finalization

(provide 'cloutlu-zen)
;;; cloutlu-zen.el ends here
#+end_src

* Lisp
:PROPERTIES:
:ID:       d4dbd0e3-3123-482f-a6ce-6e9db93937b9
:END:
